const primeministers = [
  {
    name: "伊藤博文",
    start: "1885-12-21T14:41:01.000Z",
    end: "1888-04-29T15:00:00.000Z",
    description: "第1次伊藤内閣"
  },
  {
    name: "黒田清隆",
    start: "1888-04-29T15:00:00.000Z",
    end: "1889-10-24T15:00:00.000Z",
    description: "黒田内閣"
  },
  {
    name: "三條実美",
    start: "1889-10-24T15:00:00.000Z",
    end: "1889-12-23T15:00:00.000Z",
    description: "三條暫定内閣"
  },
  {
    name: "山縣有朋",
    start: "1889-12-23T15:00:00.000Z",
    end: "1891-05-05T15:00:00.000Z",
    description: "第1次山縣内閣"
  },
  {
    name: "松方正義",
    start: "1891-05-05T15:00:00.000Z",
    end: "1892-08-07T15:00:00.000Z",
    description: "第1次松方内閣"
  },
  {
    name: "伊藤博文",
    start: "1892-08-07T15:00:00.000Z",
    end: "1896-08-30T15:00:00.000Z",
    description: "第2次伊藤内閣"
  },
  {
    name: "黒田清隆",
    start: "1896-08-30T15:00:00.000Z",
    end: "1896-09-17T15:00:00.000Z",
    description: "第2次伊藤内閣(臨時兼任)"
  },
  {
    name: "松方正義",
    start: "1896-09-17T15:00:00.000Z",
    end: "1898-01-11T15:00:00.000Z",
    description: "第2次松方内閣"
  },
  {
    name: "伊藤博文",
    start: "1898-01-11T15:00:00.000Z",
    end: "1898-06-29T15:00:00.000Z",
    description: "第3次伊藤内閣"
  },
  {
    name: "大隈重信",
    start: "1898-06-29T15:00:00.000Z",
    end: "1898-11-07T15:00:00.000Z",
    description: "第1次大隈内閣"
  },
  {
    name: "山縣有朋",
    start: "1898-11-07T15:00:00.000Z",
    end: "1900-10-18T15:00:00.000Z",
    description: "第2次山縣内閣"
  },
  {
    name: "伊藤博文",
    start: "1900-10-18T15:00:00.000Z",
    end: "1901-05-09T15:00:00.000Z",
    description: "第4次伊藤内閣"
  },
  {
    name: "西園寺公望",
    start: "1901-05-09T15:00:00.000Z",
    end: "1901-06-01T15:00:00.000Z",
    description: "第4次伊藤内閣(臨時兼任)"
  },
  {
    name: "桂太郎",
    start: "1901-06-01T15:00:00.000Z",
    end: "1906-01-06T15:00:00.000Z",
    description: "第1次桂内閣"
  },
  {
    name: "西園寺公望",
    start: "1906-01-06T15:00:00.000Z",
    end: "1908-07-13T15:00:00.000Z",
    description: "第1次西園寺内閣"
  },
  {
    name: "桂太郎",
    start: "1908-07-13T15:00:00.000Z",
    end: "1911-08-29T15:00:00.000Z",
    description: "第2次桂内閣"
  },
  {
    name: "西園寺公望",
    start: "1911-08-29T15:00:00.000Z",
    end: "1912-12-20T15:00:00.000Z",
    description: "第2次西園寺内閣"
  },
  {
    name: "桂太郎",
    start: "1912-12-20T15:00:00.000Z",
    end: "1913-02-19T15:00:00.000Z",
    description: "第3次桂内閣"
  },
  {
    name: "山本権兵衛",
    start: "1913-02-19T15:00:00.000Z",
    end: "1914-04-15T15:00:00.000Z",
    description: "第1次山本内閣"
  },
  {
    name: "大隈重信",
    start: "1914-04-15T15:00:00.000Z",
    end: "1916-10-08T15:00:00.000Z",
    description: "第2次大隈内閣"
  },
  {
    name: "寺内正毅",
    start: "1916-10-08T15:00:00.000Z",
    end: "1918-09-28T15:00:00.000Z",
    description: "寺内内閣"
  },
  {
    name: "原敬",
    start: "1918-09-28T15:00:00.000Z",
    end: "1921-11-03T15:00:00.000Z",
    description: "原内閣"
  },
  {
    name: "内田康哉",
    start: "1921-11-03T15:00:00.000Z",
    end: "1921-11-12T15:00:00.000Z",
    description: "原内閣(臨時兼任)"
  },
  {
    name: "高橋是清",
    start: "1921-11-12T15:00:00.000Z",
    end: "1922-06-11T15:00:00.000Z",
    description: "高橋内閣"
  },
  {
    name: "加藤友三郎",
    start: "1922-06-11T15:00:00.000Z",
    end: "1923-08-23T15:00:00.000Z",
    description: "加藤友三郎内閣"
  },
  {
    name: "内田康哉",
    start: "1923-08-23T15:00:00.000Z",
    end: "1923-09-01T15:00:00.000Z",
    description: "加藤友三郎内閣(臨時兼任)"
  },
  {
    name: "山本権兵衛",
    start: "1923-09-01T15:00:00.000Z",
    end: "1924-01-06T15:00:00.000Z",
    description: "第2次山本内閣"
  },
  {
    name: "清浦奎吾",
    start: "1924-01-06T15:00:00.000Z",
    end: "1924-06-10T15:00:00.000Z",
    description: "清浦内閣"
  },
  {
    name: "加藤高明",
    start: "1924-06-10T15:00:00.000Z",
    end: "1926-01-27T15:00:00.000Z",
    description: "加藤高明内閣"
  },
  {
    name: "若槻禮次郎",
    start: "1926-01-27T15:00:00.000Z",
    end: "1926-01-29T15:00:00.000Z",
    description: "加藤高明内閣(臨時兼任)"
  },
  {
    name: "若槻禮次郎",
    start: "1926-01-29T15:00:00.000Z",
    end: "1927-04-19T15:00:00.000Z",
    description: "第1次若槻内閣"
  },
  {
    name: "田中義一",
    start: "1927-04-19T15:00:00.000Z",
    end: "1929-07-01T15:00:00.000Z",
    description: "田中義一内閣"
  },
  {
    name: "濱口雄幸",
    start: "1929-07-01T15:00:00.000Z",
    end: "1931-04-13T15:00:00.000Z",
    description: "濱口内閣"
  },
  {
    name: "若槻禮次郎",
    start: "1931-04-13T15:00:00.000Z",
    end: "1931-12-12T15:00:00.000Z",
    description: "第2次若槻内閣"
  },
  {
    name: "犬養毅",
    start: "1931-12-12T15:00:00.000Z",
    end: "1932-05-15T15:00:00.000Z",
    description: "犬養内閣"
  },
  {
    name: "高橋是清",
    start: "1932-05-15T15:00:00.000Z",
    end: "1932-05-25T15:00:00.000Z",
    description: "犬養内閣(臨時兼任)"
  },
  {
    name: "齋藤実",
    start: "1932-05-25T15:00:00.000Z",
    end: "1934-07-07T15:00:00.000Z",
    description: "齋藤内閣"
  },
  {
    name: "岡田啓介",
    start: "1934-07-07T15:00:00.000Z",
    end: "1936-03-08T15:00:00.000Z",
    description: "岡田内閣"
  },
  {
    name: "廣田弘毅",
    start: "1936-03-08T15:00:00.000Z",
    end: "1937-02-01T15:00:00.000Z",
    description: "廣田内閣"
  },
  {
    name: "林銑十郎",
    start: "1937-02-01T15:00:00.000Z",
    end: "1937-06-03T15:00:00.000Z",
    description: "林内閣"
  },
  {
    name: "近衛文麿",
    start: "1937-06-03T15:00:00.000Z",
    end: "1939-01-04T15:00:00.000Z",
    description: "第1次近衛内閣"
  },
  {
    name: "平沼騏一郎",
    start: "1939-01-04T15:00:00.000Z",
    end: "1939-08-29T15:00:00.000Z",
    description: "平沼内閣"
  },
  {
    name: "阿部信行",
    start: "1939-08-29T15:00:00.000Z",
    end: "1940-01-15T15:00:00.000Z",
    description: "阿部内閣"
  },
  {
    name: "米内光政",
    start: "1940-01-15T15:00:00.000Z",
    end: "1940-07-21T15:00:00.000Z",
    description: "米内内閣"
  },
  {
    name: "近衛文麿",
    start: "1940-07-21T15:00:00.000Z",
    end: "1941-07-17T15:00:00.000Z",
    description: "第2次近衛内閣"
  },
  {
    name: "近衛文麿",
    start: "1941-07-17T15:00:00.000Z",
    end: "1941-10-17T15:00:00.000Z",
    description: "第3次近衛内閣"
  },
  {
    name: "東條英機",
    start: "1941-10-17T15:00:00.000Z",
    end: "1944-07-21T15:00:00.000Z",
    description: "東條内閣"
  },
  {
    name: "小磯國昭",
    start: "1944-07-21T15:00:00.000Z",
    end: "1945-04-06T15:00:00.000Z",
    description: "小磯内閣"
  },
  {
    name: "鈴木貫太郎",
    start: "1945-04-06T15:00:00.000Z",
    end: "1945-08-16T15:00:00.000Z",
    description: "鈴木貫太郎内閣"
  },
  {
    name: "鈴木貫太郎",
    start: "1945-08-16T15:00:00.000Z",
    end: "1945-10-08T15:00:00.000Z",
    description: "東久邇宮内閣"
  },
  {
    name: "幣原喜重郎",
    start: "1945-10-08T15:00:00.000Z",
    end: "1946-05-21T15:00:00.000Z",
    description: "幣原内閣"
  },
  {
    name: "吉田茂",
    start: "1946-05-21T15:00:00.000Z",
    end: "1947-05-23T15:00:00.000Z",
    description: "第1次吉田内閣"
  },
  {
    name: "片山哲",
    start: "1947-05-23T15:00:00.000Z",
    end: "1948-03-09T15:00:00.000Z",
    description: "片山内閣"
  },
  {
    name: "芦田均",
    start: "1948-03-09T15:00:00.000Z",
    end: "1948-10-14T15:00:00.000Z",
    description: "芦田内閣"
  },
  {
    name: "吉田茂",
    start: "1948-10-14T15:00:00.000Z",
    end: "1949-02-15T15:00:00.000Z",
    description: "第2次吉田内閣"
  },
  {
    name: "吉田茂",
    start: "1949-02-15T15:00:00.000Z",
    end: "1952-10-29T15:00:00.000Z",
    description: "第3次吉田内閣"
  },
  {
    name: "吉田茂",
    start: "1952-10-29T15:00:00.000Z",
    end: "1953-05-20T15:00:00.000Z",
    description: "第4次吉田内閣"
  },
  {
    name: "吉田茂",
    start: "1953-05-20T15:00:00.000Z",
    end: "1954-12-09T15:00:00.000Z",
    description: "第5次吉田内閣"
  },
  {
    name: "鳩山一郎",
    start: "1954-12-09T15:00:00.000Z",
    end: "1955-03-18T15:00:00.000Z",
    description: "第1次鳩山一郎内閣"
  },
  {
    name: "鳩山一郎",
    start: "1955-03-18T15:00:00.000Z",
    end: "1955-11-21T15:00:00.000Z",
    description: "第2次鳩山一郎内閣"
  },
  {
    name: "鳩山一郎",
    start: "1955-11-21T15:00:00.000Z",
    end: "1956-12-22T15:00:00.000Z",
    description: "第3次鳩山一郎内閣"
  },
  {
    name: "石橋湛山",
    start: "1956-12-22T15:00:00.000Z",
    end: "1957-02-24T15:00:00.000Z",
    description: "石橋内閣"
  },
  {
    name: "岸信介",
    start: "1957-02-24T15:00:00.000Z",
    end: "1958-06-11T15:00:00.000Z",
    description: "第1次岸内閣"
  },
  {
    name: "岸信介",
    start: "1958-06-11T15:00:00.000Z",
    end: "1960-07-18T15:00:00.000Z",
    description: "第2次岸内閣"
  },
  {
    name: "池田勇人",
    start: "1960-07-18T15:00:00.000Z",
    end: "1960-12-07T15:00:00.000Z",
    description: "第1次池田内閣"
  },
  {
    name: "池田勇人",
    start: "1960-12-07T15:00:00.000Z",
    end: "1963-12-08T15:00:00.000Z",
    description: "第2次池田内閣"
  },
  {
    name: "池田勇人",
    start: "1963-12-08T15:00:00.000Z",
    end: "1964-11-08T15:00:00.000Z",
    description: "第3次池田内閣"
  },
  {
    name: "佐藤栄作",
    start: "1964-11-08T15:00:00.000Z",
    end: "1967-02-16T15:00:00.000Z",
    description: "第1次佐藤内閣"
  },
  {
    name: "佐藤栄作",
    start: "1967-02-16T15:00:00.000Z",
    end: "1970-01-13T15:00:00.000Z",
    description: "第2次佐藤内閣"
  },
  {
    name: "佐藤栄作",
    start: "1970-01-13T15:00:00.000Z",
    end: "1972-07-06T15:00:00.000Z",
    description: "第3次佐藤内閣"
  },
  {
    name: "田中角栄",
    start: "1972-07-06T15:00:00.000Z",
    end: "1972-12-21T15:00:00.000Z",
    description: "第1次田中角栄内閣"
  },
  {
    name: "田中角栄",
    start: "1972-12-21T15:00:00.000Z",
    end: "1974-12-08T15:00:00.000Z",
    description: "第2次田中角栄内閣"
  },
  {
    name: "三木武夫",
    start: "1974-12-08T15:00:00.000Z",
    end: "1976-12-23T15:00:00.000Z",
    description: "三木内閣"
  },
  {
    name: "福田赳夫",
    start: "1976-12-23T15:00:00.000Z",
    end: "1978-12-06T15:00:00.000Z",
    description: "福田赳夫内閣"
  },
  {
    name: "大平正芳",
    start: "1978-12-06T15:00:00.000Z",
    end: "1979-11-08T15:00:00.000Z",
    description: "第1次大平内閣"
  },
  {
    name: "大平正芳",
    start: "1979-11-08T15:00:00.000Z",
    end: "1980-06-11T15:00:00.000Z",
    description: "第2次大平内閣"
  },
  {
    name: "伊東正義",
    start: "1980-06-11T15:00:00.000Z",
    end: "1980-07-16T15:00:00.000Z",
    description: "第2次大平内閣(臨時代理)"
  },
  {
    name: "鈴木善幸",
    start: "1980-07-16T15:00:00.000Z",
    end: "1982-11-26T15:00:00.000Z",
    description: "鈴木善幸内閣"
  },
  {
    name: "中曽根康弘",
    start: "1982-11-26T15:00:00.000Z",
    end: "1983-12-26T15:00:00.000Z",
    description: "第1次中曽根内閣"
  },
  {
    name: "中曽根康弘",
    start: "1983-12-26T15:00:00.000Z",
    end: "1986-07-21T15:00:00.000Z",
    description: "第2次中曽根内閣"
  },
  {
    name: "中曽根康弘",
    start: "1986-07-21T15:00:00.000Z",
    end: "1987-11-05T15:00:00.000Z",
    description: "第3次中曽根内閣"
  },
  {
    name: "竹下登",
    start: "1987-11-05T15:00:00.000Z",
    end: "1989-06-02T15:00:00.000Z",
    description: "竹下内閣"
  },
  {
    name: "宇野宗佑",
    start: "1989-06-02T15:00:00.000Z",
    end: "1989-08-09T15:00:00.000Z",
    description: "宇野内閣"
  },
  {
    name: "海部俊樹",
    start: "1989-08-09T15:00:00.000Z",
    end: "1990-02-27T15:00:00.000Z",
    description: "第1次海部内閣"
  },
  {
    name: "海部俊樹",
    start: "1990-02-27T15:00:00.000Z",
    end: "1991-11-04T15:00:00.000Z",
    description: "第2次海部内閣"
  },
  {
    name: "宮澤喜一",
    start: "1991-11-04T15:00:00.000Z",
    end: "1993-08-08T15:00:00.000Z",
    description: "宮澤内閣"
  },
  {
    name: "細川護熙",
    start: "1993-08-08T15:00:00.000Z",
    end: "1994-04-27T15:00:00.000Z",
    description: "細川内閣"
  },
  {
    name: "羽田孜",
    start: "1994-04-27T15:00:00.000Z",
    end: "1994-06-29T15:00:00.000Z",
    description: "羽田内閣"
  },
  {
    name: "村山富市",
    start: "1994-06-29T15:00:00.000Z",
    end: "1996-01-10T15:00:00.000Z",
    description: "村山内閣"
  },
  {
    name: "橋本龍太郎",
    start: "1996-01-10T15:00:00.000Z",
    end: "1996-11-06T15:00:00.000Z",
    description: "第1次橋本内閣"
  },
  {
    name: "橋本龍太郎",
    start: "1996-11-06T15:00:00.000Z",
    end: "1998-07-29T15:00:00.000Z",
    description: "第2次橋本内閣"
  },
  {
    name: "小渕恵三",
    start: "1998-07-29T15:00:00.000Z",
    end: "2000-04-04T15:00:00.000Z",
    description: "小渕内閣"
  },
  {
    name: "森喜朗",
    start: "2000-04-04T15:00:00.000Z",
    end: "2000-07-03T15:00:00.000Z",
    description: "第1次森内閣"
  },
  {
    name: "森喜朗",
    start: "2000-07-03T15:00:00.000Z",
    end: "2001-04-25T15:00:00.000Z",
    description: "第2次森内閣"
  },
  {
    name: "小泉純一郎",
    start: "2001-04-25T15:00:00.000Z",
    end: "2003-11-18T15:00:00.000Z",
    description: "第1次小泉内閣"
  },
  {
    name: "小泉純一郎",
    start: "2003-11-18T15:00:00.000Z",
    end: "2005-09-20T15:00:00.000Z",
    description: "第2次小泉内閣"
  },
  {
    name: "小泉純一郎",
    start: "2005-09-20T15:00:00.000Z",
    end: "2006-09-25T15:00:00.000Z",
    description: "第3次小泉内閣"
  },
  {
    name: "安倍晋三",
    start: "2006-09-25T15:00:00.000Z",
    end: "2007-09-25T15:00:00.000Z",
    description: "第1次安倍内閣"
  },
  {
    name: "福田康夫",
    start: "2007-09-25T15:00:00.000Z",
    end: "2008-09-23T15:00:00.000Z",
    description: "福田康夫内閣"
  },
  {
    name: "麻生太郎",
    start: "2008-09-23T15:00:00.000Z",
    end: "2009-09-15T15:00:00.000Z",
    description: "麻生内閣"
  },
  {
    name: "鳩山由紀夫",
    start: "2009-09-15T15:00:00.000Z",
    end: "2010-06-07T15:00:00.000Z",
    description: "鳩山由紀夫内閣"
  },
  {
    name: "菅直人",
    start: "2010-06-07T15:00:00.000Z",
    end: "2011-09-01T15:00:00.000Z",
    description: "菅内閣"
  },
  {
    name: "野田佳彦",
    start: "2011-09-01T15:00:00.000Z",
    end: "2012-12-25T15:00:00.000Z",
    description: "野田内閣"
  },
  {
    name: "安倍晋三",
    start: "2012-12-25T15:00:00.000Z",
    end: "2014-12-23T15:00:00.000Z",
    description: "第2次安倍内閣"
  },
  {
    name: "安倍晋三",
    start: "2014-12-23T15:00:00.000Z",
    end: null,
    description: "第3次安倍内閣"
  }
];